# steps
MENU_STEP = "MENU"

# registration
WELCOME_MESSAGE = "Добро пожаловать!"
ALREADY_REGISTERED_MESSAGE = "Вы уже зарегистрированы."
NOT_REGISTERED_MESSAGE = (
    "Вы ещё не прошли регистрацию ❌\nДавайте это исправим! Напишите команду /start."
)

# menu keyboard buttons
LOOK_BUTTON = "Посмотреть ассортимент"

# help message
HELP_MESSAGE = "Условная помощь."

# random text on menu step
DO_NOT_KNOW_THE_COMMAND_MESSAGE = "Извините, я Вас не понимаю. Для взаимодействия с ботом нажмите на одну из кнопок в меню."

# no available models
ZERO_MODELS_MESSAGE = "На текущий момент нет моделей, доступных для покупки."

# scroll message is expired (>48 hours)
SCROLL_IS_TOO_OLD = "Сообщение устарело и с ним невозможно взаимодействовать. Нажмите на кнопку «Мои проблемы 📖» еще раз."

# scroll buttons
LEFT_BUTTON = "⬅️"
RIGHT_BUTTON = "➡️"
DELETE_BUTTON = "❌ Удалить"
